# IsViewUpdateForced Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentPreviewSettings..::..IsViewUpdateForced Property
DocumentPreviewSettings Class See Also
---
Identifies if Revit will update the preview view if necessary.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsViewUpdateForced { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsViewUpdateForced As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsViewUpdateForced {
	bool get ();
}
```

# Remarks
This setting applies only to a single Save operation and is reset to false after it is accessed.
# See Also
DocumentPreviewSettings Class
Autodesk.Revit.DB Namespace